kafka/gce/bench-results.bak/direct/2016-07-06.02-44/producers/client-1.log
2016:07:06 00:45:17,5121 records sent, 1024.0 records/sec (1.00 MB/sec), 1.1 ms avg latency, 230.0 max latency.
2016:07:06 00:45:22,5128 records sent, 1025.2 records/sec (1.00 MB/sec), 0.7 ms avg latency, 10.0 max latency.
2016:07:06 00:45:27,5123 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 11.0 max latency.
2016:07:06 00:45:32,5125 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 7.0 max latency.
2016:07:06 00:45:37,5124 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 10.0 max latency.
2016:07:06 00:45:42,5122 records sent, 1024.2 records/sec (1.00 MB/sec), 0.5 ms avg latency, 7.0 max latency.
2016:07:06 00:45:47,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 0.5 ms avg latency, 8.0 max latency.
2016:07:06 00:45:52,5123 records sent, 1024.6 records/sec (1.00 MB/sec), 0.5 ms avg latency, 8.0 max latency.
2016:07:06 00:45:57,5123 records sent, 1024.4 records/sec (1.00 MB/sec), 0.5 ms avg latency, 9.0 max latency.
2016:07:06 00:46:02,5123 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 13.0 max latency.
2016:07:06 00:46:07,5123 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 10.0 max latency.
2016:07:06 00:46:12,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 0.7 ms avg latency, 31.0 max latency.
2016:07:06 00:46:17,5122 records sent, 1024.4 records/sec (1.00 MB/sec), 0.5 ms avg latency, 9.0 max latency.
2016:07:06 00:46:22,5123 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 21.0 max latency.
2016:07:06 00:46:27,5123 records sent, 1024.6 records/sec (1.00 MB/sec), 0.5 ms avg latency, 10.0 max latency.
2016:07:06 00:46:32,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 23.0 max latency.
2016:07:06 00:46:37,5123 records sent, 1024.4 records/sec (1.00 MB/sec), 0.5 ms avg latency, 9.0 max latency.
2016:07:06 00:46:42,5123 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 26.0 max latency.
2016:07:06 00:46:47,5124 records sent, 1024.6 records/sec (1.00 MB/sec), 0.7 ms avg latency, 34.0 max latency.
2016:07:06 00:46:52,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 0.5 ms avg latency, 7.0 max latency.
2016:07:06 00:46:57,5124 records sent, 1024.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 21.0 max latency.
2016:07:06 00:47:02,5125 records sent, 1024.6 records/sec (1.00 MB/sec), 0.5 ms avg latency, 8.0 max latency.
2016:07:06 00:47:07,5124 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 15.0 max latency.
2016:07:06 00:47:12,5125 records sent, 1025.0 records/sec (1.00 MB/sec), 0.5 ms avg latency, 5.0 max latency.
2016:07:06 00:47:17,5123 records sent, 1024.4 records/sec (1.00 MB/sec), 0.5 ms avg latency, 11.0 max latency.
2016:07:06 00:47:22,5123 records sent, 1024.6 records/sec (1.00 MB/sec), 0.5 ms avg latency, 8.0 max latency.
2016:07:06 00:47:27,5131 records sent, 1025.8 records/sec (1.00 MB/sec), 0.5 ms avg latency, 9.0 max latency.
2016:07:06 00:47:32,5122 records sent, 1024.2 records/sec (1.00 MB/sec), 0.5 ms avg latency, 8.0 max latency.
2016:07:06 00:47:37,5122 records sent, 1024.2 records/sec (1.00 MB/sec), 0.5 ms avg latency, 8.0 max latency.
2016:07:06 00:47:42,5124 records sent, 1024.6 records/sec (1.00 MB/sec), 0.5 ms avg latency, 8.0 max latency.
2016:07:06 00:47:47,5124 records sent, 1024.6 records/sec (1.00 MB/sec), 1.0 ms avg latency, 65.0 max latency.
2016:07:06 00:47:52,5124 records sent, 1024.4 records/sec (1.00 MB/sec), 0.5 ms avg latency, 9.0 max latency.
2016:07:06 00:47:57,5124 records sent, 1024.6 records/sec (1.00 MB/sec), 0.5 ms avg latency, 8.0 max latency.
2016:07:06 00:48:02,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 0.5 ms avg latency, 7.0 max latency.
2016:07:06 00:48:07,5124 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 12.0 max latency.
2016:07:06 00:48:12,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 0.5 ms avg latency, 8.0 max latency.
2016:07:06 00:48:17,5123 records sent, 1024.2 records/sec (1.00 MB/sec), 1.0 ms avg latency, 66.0 max latency.
2016:07:06 00:48:22,5124 records sent, 1024.4 records/sec (1.00 MB/sec), 0.5 ms avg latency, 7.0 max latency.
2016:07:06 00:48:27,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 0.5 ms avg latency, 9.0 max latency.
2016:07:06 00:48:32,5128 records sent, 1025.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 9.0 max latency.
2016:07:06 00:48:37,5124 records sent, 1024.4 records/sec (1.00 MB/sec), 0.5 ms avg latency, 7.0 max latency.
2016:07:06 00:48:42,215040 records sent, 1023.960992 records/sec (1.00 MB/sec), 0.59 ms avg latency, 230.00 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 15 ms 99.9th.